9.1_R3/app/controllers/images_controller.rb

  def create
    @image = Image.new(image_params.merge(user: current_user))

    respond_to do |format|
      if @image.save
---
INSERT INTO "images" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2020-06-01 13:25:39.531070"], ["updated_at", "2020-06-01 13:25:39.531070"]]

  def update
    respond_to do |format|
      if @image.update(image_params)
---
UPDATE "images" SET "updated_at" = $1 WHERE "images"."id" = $2  [["updated_at", "2020-06-01 13:41:58.025039"], ["id", 5]]