9.3_cool_api/app/controllers/api/v1/artciles_controller.rb

INSERT INTO "artciles" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ok"], ["content", "okok"], ["user_id", 1], ["created_at", "2020-06-04 07:40:24.219260"], ["updated_at", "2020-06-04 07:40:24.219260"]]
---
  def create
    @artcile = Artcile.new(artcile_params)

    if @artcile.save