9.3_cool_api/app/controllers/api/v1/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "whaou"], ["user_id", 1], ["image_id", 1], ["created_at", "2020-06-03 21:03:58.184333"], ["updated_at", "2020-06-03 21:03:58.184333"]]
---
  def create
    @comment = Comment.new(comment_params)

    if @comment.save