9.3_cool_api/app/controllers/api/v1/images_controller.rb

  def create
    @image = Image.new(image_params)

    if @image.save
---
INSERT INTO "images" ("stream", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["stream", "<56 bytes of binary data>"], ["user_id", 1], ["created_at", "2020-06-03 19:32:33.322916"], ["updated_at", "2020-06-03 19:32:33.322916"]]