9.3_cool_api/app/controllers/api/v1/profile_controller.rb

SELECT "images".* FROM "images" WHERE "images"."user_id" = ?  [["user_id", 1]]
---
  def my_images
    render json: Image.where(user: current_user)

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]
---
  def my_comments
    render json: Comment.where(user: current_user)